{
  "post": [
    {
      "id": 1,
      "title": "Allison to Liverpool",
      "author": "Neil Jones",
      "date": "2018-05-31",
      "image": "https://cdn-04.independent.ie/incoming/article37185044.ece/e4bc3/AUTOCROP/w620/11allison.jpg",
      "content": "The Brazilian goalkeeper is now due to hold talks over a move to   Anfield as Jurgen Klopp closes in on a major summer signing. Liverpool are closing in on the signing of Alisson after agreeing a £66 million ($86m) fee with Roma for the Brazilian goalkeeper, Goal can confirm.",
      "story": "The Brazilian goalkeeper is now due to hold talks over a move to   Anfield as Jurgen Klopp closes in on a major summer signing. Liverpool are closing in on the signing of Alisson after agreeing a £66 million ($86m) fee with Roma for the Brazilian goalkeeper, Goal can confirm. The Reds have been in intensive talks with the Serie A club this week, and now have permission to speak to the player about a move to Anfield. The deal would make the 25-year-old the most expensive goalkeeper in history, and comes as Jurgen Klopp seeks to strengthen a position that was a problem long before Loris Karius' much-publicised errors in the Champions League final in May. Alisson, it is understood, is open to the idea of a move to Merseyside, but Liverpool could face competition from Chelsea, who look set to lose their own goalkeeper, Thibaut Courtois, to Real Madrid. Liverpool, though, are growing confident they can win the race, which would mean they have broken the world transfer record for both goalkeepers and defenders in the last seven months. The Reds have already added Virgil van Dijk, Fabinho, Naby Keita and Xherdan Shaqiri to their squad in 2018, and the addition of Alisson, identified by the club's recruitment team as their top goalkeeping target last season, would be seen as a huge boost ahead of the new Premier League campaign. Liverpool fly to the USA for a three-game tour on Saturday, though Alisson would not be expected to return to training until after that in any case. Klopp had pinpointed Alisson as his preferred goalkeeping target, with the Reds boss aware that none of Karius, Simon Mignolet or Danny Ward have nailed down the No.1 shirt at Anfield. Karius's mistakes in the Champions League final against Madrid in Kiev, and doubts about the lasting effect they will have on his confidence, reintensified Liverpool’s efforts to recruit Alisson. Ward is said to be impressing Klopp in training, but now appears unlikely to get a lasting chance to stake a claim to be first choice as the deal for Alisson edges closer. Roma had been keen to avoid a repeat of last summer when they sold Mohamed Salah to Liverpool at what now looks a ridiculously low fee and made it clear that they are not prepared for the same to happen with Alisson. However, Liverpool’s offer has now met Roma’s valuation, leaving the Serie A club to step up their search for a replacement."
    },
    {
      "id": 2,
      "title": "DeMar DeRozan expresses anger ",
      "author": "Kurt Helin",
      "date": "2018-07-18",
      "image": "https://shawglobalnews.files.wordpress.com/2017/05/ohtd116-52_2017_021501_high1.jpg?quality=70&strip=all&w=650&h=480&crop=1",
      "content": "DeMar DeRozan has been loyal to Toronto. He embraced the city when former stars abandoned it and pushed their way out of town. In 2016, as a free agent, he didn’t even meet with another team, he had no intention of leaving.",
      "story": "DeMar DeRozan has been loyal to Toronto. He embraced the city when former stars abandoned it and pushed their way out of town. In 2016, as a free agent, he didn’t even meet with another team, he had no intention of leaving. He said he wanted to go down as the greatest Raptor ever. A Los Angeles kid himself — born and raised in Compton — he never pushed to go home, instead becoming incredibly active in the community off the court as well as being a four-time All-Star, two-time All-NBA player on it. He has led the greatest run of Raptors basketball in franchise history. The Raptors were not loyal to DeRozan — they are shipping him to Texas in a trade forKawhi Leonard that is being finalized. DeRozan reportedly hates the move and put this up as an Instagram story. Be told one thing & the outcome another. Can’t trust em. Ain’t no loyalty in this game. Sell you out quick for a little bit of nothing… Soon you’ll understand… Don’t disturb… Leonard reportedly also is unhappy with the trade — he wanted to go home to Los Angeles. However, Lakers would not the players the Spurs wanted into a trade (Brandon Ingram, Kyle Kuzma and more), and the Clippers do not have the assets to interest the Spurs in a trade. San Antonio was holding out for other bidders, biding their time, and in came Raptors’ GM Masai Ujiri with an aggressive move. Leonard’s inexperienced management team, which did not handle this situation well, wanted him in a major market that would boost Leonard’s marketing opportunities. While Toronto is a big market — sixth largest in the NBA, bigger than Philadelphia — and is the team of a nation with fans across Canada, this is not what Leonard’s people wanted. He is a free agent next summer in 2019. DeRozan has every right to feel betrayed — next time you think of complaining about how players are not loyal to cities/teams/fans, remember this. Loyalty is a luxury in the NBA and one rarely rewarded. DeRozan also will come around and embrace San Antonio, the Spurs culture, and Gregg Popovich. He will help them win a lot. Whether the Raptors can win over Leonard becomes one of the NBA’s biggest storylines of 2018-19."
    },
    {
      "id": 3,
      "title": "Why making pitchers bat is one of baseball's most beautiful facets",
      "author": "Les Carpenter ",
      "date": "2018-06-16",
      "image": "https://bloximages.newyork1.vip.townnews.com/kmaland.com/content/tncms/assets/v3/editorial/9/3c/93c8c75c-0dbe-11e4-843e-0017a43b2370/53c7dd8c3711f.image.jpg",
      "content": "It was a stray comment, a line tossed out by Tony Clark, the head of the baseball players union in his annual address to the media on Tuesday. But in saying baseball is getting closer to a day when pitchers will no longer hit in the National League, he may have set off an earthquake. “Players are talking more about it than in the past,”  ",
      "story": "It was a stray comment, a line tossed out by Tony Clark, the head of the baseball players union in his annual address to the media on Tuesday. But in saying baseball is getting closer to a day when pitchers will no longer hit in the National League, he may have set off an earthquake. “Players are talking more about it than in the past,” Clark said, adding that the concept of bringing the designated hitter, who effectively bats for the pitcher, to the NL “is gaining momentum.” That the NL didn’t adopt a designated hitter when the American League did in 1973 is a stroke of stubborn brilliance that makes baseball feel special in a homogenized sports world, where moving teams often means little more than a change of city. The NL is almost alone in its resistance to the designated hitter, which has been adopted in most every professional and amateur baseball league globally. Changing this order would whitewash a part of baseball’s charm. Even more, it would eliminate one of the game’s great joys: watching the pitcher hit. Baseball is a sport filled with sluggers who can blast balls 450 feet. There is something appealing about a pitcher who flails helplessly at pitches, creating the perfect counterbalance to a world built on power. “Of course its fun to hit,” Oakland Athletics pitcher Blake Treinen said before Tuesday’s All-Star game as he stood in the American League clubhouse. “It’s every kid’s dream to swing the bat in a big league game.” As a member of the Washington Nationals for five seasons, Treinen had 19 plate appearances, which resulted in a single and a walk among 17 outs. Four of those plate appearances were sacrifice bunts but nine were strikeouts. A typical pitcher’s performance. “I know baseball is looking for ways to make the game more exciting, but baseball is great as long as you keep it simple,” he said with a sigh. “I don’t really like the big changes.” Treinen said he understood the reasons behind the designated hitter: that pitchers are in the majors for their pitching and not their hitting, that pitchers are often automatic outs and that people often talk abut wanting more offense in the game. He knows, too, that the designated hitter provides an opportunity for some players who don’t field a position well or have injuries that keep them from running on the field. But he also wonders why everyone assumes hitting pitchers are a bad idea. “I think a lot of fans enjoy watching pitchers hit,” he said. As in someone like Bartolo Colon, he of a .094 lifetime batting average, slugging his first-ever home run at the age of 42, as he did in San Diego back in 2016? “Yes,” Treinen said with a laugh. “But also someone like [former Nats teammate] Max Scherzer coming up and everyone wondering: ‘Can he hit a grounder up the middle that will be a base hit?’” Across the room, Toronto Blue Jays pitcher JA Happ seemed to agree. Happ, who came up through the minors in the Philadelphia Phillies organization, hitting on occasion with modest success, enjoys the strategy that comes with the National League game: watching managers manipulate the way they pitch to teams, trying to get to the pitcher, who will most-likely make an out; or seeing how managers must decide whether to pinch hit for a pitcher who is throwing well, all in the hopes of getting a run. “There’s definitely a difference between the two leagues, right?” he asked. “It’s part of the uniqueness of the two leagues.” Happ shrugged. He hadn’t heard Clark’s comments earlier in the day. There had been celebrations and a parade before batting practice so the players were generally unaware of most news being made around the All Star Game. Who knows the context of Clark’s remarks? Were they off-hand, wishful or serious? Baseball commissioner Rob Manfred seemed surprised when he spoke to the media after Clark. He said that since he had been the league’s chief labor negotiator the last 16 years he “could have made a deal” with the union to force the designated hitter upon the NL. But doing so never seemed a priority. “I think the most likely outcome at this point remains status quo,” he said. Which must be relief to all Bartolo Colon fans out there. Colon is still pitching at the age of 45 and still hitting in interleague games for the American League Texas Rangers where this year he is 0-for-2 with a strikeout."
    },
    {
      "id": 4,
      "title": "France World Cup win",
      "author": "Mark Ogden",
      "date": "2018-07-16",
      "image": "http://a.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F0715%2Fr401310_1296x729_16%2D9.jpg&w=570",
      "content": "MOSCOW -- He is still only 19 years old, but Kylian Mbappe has already gone one better than Lionel Messi and Cristiano Ronaldo. The France prodigy now has a World Cup winners' medal in his pocket, and Messi and Ronaldo have spent all of their careers chasing that elusive piece of gold.",
      "story": "MOSCOW -- He is still only 19 years old, but Kylian Mbappe has already gone one better than Lionel Messi and Cristiano Ronaldo. The France prodigy now has a World Cup winners' medal in his pocket, and Messi and Ronaldo have spent all of their careers chasing that elusive piece of gold. Their failure -- a harsh word considering their respective stellar careers -- to win a World Cup is something that continues to be used as a negative when the debate about who is the greatest of all time kicks into gear. It is still what sets Pele and Diego Maradona apart in the eyes of many. Mbappe has a long way to go before his name gets through into that bracket, but when he does -- it feels more like when than if -- there will be no asterisk alongside it that says yet to win a World Cup. The Paris Saint-Germain forward is the heir apparent to Messi and Ronaldo, and the 2018 World Cup final felt like a changing of the guard. The new kid on the block is ready to take over. Not only has he won a World Cup, but he has joined Pele in the record books by becoming the first teenager to score in a World Cup final since the Brazil icon managed it as a 17-year-old in 1958. His goal in France's 4-2 win against Croatia in Moscow was no mere footnote, either. It was the fourth for Mbappe at Russia 2018 in seven games and further proof of what a central figure he has been in France's success. Mbappe's stunning two-goal display in the second-round victory against Argentina in Kazan was a decisive contribution and set Didier Deschamps' team on course for the glory they tasted in the Luzhniki Stadium. When the story of France's second world title is told, Mbappe will be front and centre. He was already a star before this final. His Champions League feats with Monaco in 2016-17, which earned him a £160 million move to PSG, ensured he was no unknown rookie in Russia, but he has elevated himself to global stardom now, and many within the game expect him to dominate the biggest stage for years to come."
    }
  ],
  "users": [
    {
      "id": 1,
      "username": "abnuto",
      "password": "abnuto1998",
      "email": "abnuto.samuels@gmail.com"
    },
    {
      "username": "reece",
      "password": "994",
      "email": "jaysonmanas@gmail.com",
      "id": 2
    },
    {
      "username": "john-paul",
      "password": "john23",
      "email": "japes013@gmail.com",
      "id": 3
    },
    {
      "username": "alex",
      "password": "alex20",
      "email": "alex@gmail.com",
      "id": 4
    },
    {
      "username": "",
      "password": "",
      "email": "",
      "id": 5
    }
  ]
}
